---
kind: other
id: Properties.T:Autodesk.Revit.DB.ParameterFilterRuleFactory
source: html/375efdcb-65b9-ef60-9926-85d67d5da7fd.htm
---
# ParameterFilterRuleFactory Properties

Specifies whether the .NET object represents a valid Revit entity.